yii/backend/views/equip/index.php

SELECT * FROM `equip` WHERE `id`='2'
---
                'attribute' => 'sid',
                'value' => function($model){
                    $sid = empty($model->sid)?'':explode(',',$model->sid);
                    $new = '';
                    if (is_array($sid)){
                        foreach ($sid as $value){
                            $new .= '+'.$model->findOne($value)->name;
                        }
                        $new = substr($new,1);
                    }
                    return $new;
                }
            ],
            //'type',
            [
                'attribute' => 'type',
                'value' => function($data){
                    return \backend\models\Equip::$typeList[$data->type];
                },
                'filter' => ['1'=>'装备','0'=>'卷轴'],
                'headerOptions' => ['width' => '170'],
            ],
            ['class' => 'yii\grid\ActionColumn'],
        ],