yii/backend/views/skill/_form.php


    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'hero_id')->dropDownList(ArrayHelper::map($model->AllHeros,'id','name')) ?>
---
SELECT * FROM `hero` WHERE 0=1