yii/backend/views/rabc/index.php

    <?= Html::a('初始化权限', ['init'], ['class' => 'btn btn-success']) ?>
    <?php foreach ($model->auth as $key => $value): ?>
        <h3><?php echo $value->description ?></h3>
        <?= $form->field($model,'description')->checkboxList(ArrayHelper::map($model->item,'name','description'),['name'=>$value->name,'value'=>ArrayHelper::getColumn($value->children,'name')])->label(false) //@imp 复选框+arrayhelper?>
---
SELECT * FROM `auth_item` WHERE `name` IN ('equipcontroller_actioncreate', 'equipcontroller_actiondelete', 'skillcontroller_actioncreate', 'skillcontroller_actiondelete')