yii/backend/controllers/EquipController.php

    protected function findModel($id)
    {
        if (($model = Equip::findOne($id)) !== null) {
---
SELECT * FROM `equip` WHERE `id`='1'