yii/backend/controllers/HeroController.php

    public function actionCreate()
    {
        $model = new Hero();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `hero` (`name`, `type`, `str`, `int`, `dex`, `hp`, `mp`, `min_atk`, `max_atk`, `def`, `dps`, `speed`) VALUES ('祈求者', 2, 18, 16, 14, 524, 315, 35, 41, 1.2, 25, 282)

    protected function findModel($id)
    {
        if (($model = Hero::findOne($id)) !== null) {
---
SELECT * FROM `hero` WHERE `id`='1'