yii/backend/controllers/SkillController.php

SELECT * FROM `skill` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Skill::findOne($id)) !== null) {