yii/backend/models/AuthItem.php

SELECT * FROM `auth_item` WHERE type=2
---
    public function getItem()
    {
        return self::find()->where('type=2')->all();

SELECT * FROM `auth_item` WHERE type=1
---
    public function getAuth()
    {
        return self::find()->where('type=1')->all();