yii/backend/models/Skill.php

    public function getAllHeros()
    {
        return Hero::find()->all();
---
SELECT * FROM `hero`