yii/backend/models/SysUser.php

SELECT * FROM `sys_user` WHERE (`id`=11) AND (`status`=2)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `sys_user` WHERE (`username`='aaa') AND (`status`=2)
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);